; domain
(define (domain emergencias)
    (:requirements :strips :typing)
    (:types
        location box bcontent grip person dron - object
    )

    (:predicates
        (at-dron ?d - dron ?l - location) 
        (at-box ?b - box ?l - location)
        (at-person ?p - person ?l - location)
        
        (box-has ?b - box ?c - bcontent)
        (person-has ?p - person ?c - bcontent)
        
        (free ?g - grip)
        (carrying ?d - dron ?g - grip ?b - box)
    )


    (:action move
        :parameters (?from - location ?to - location ?dron - dron)
        :precondition (at-dron ?dron ?from)
        :effect (and (at-dron ?dron ?to)(not(at-dron ?dron ?from)))
    )

    (:action pick
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron)
        :precondition (and (at-dron ?dron ?location)(at-box ?box ?location)(free ?gripper))
        :effect (and (not (at-box ?box ?location))(not (free ?gripper))(carrying ?dron ?gripper ?box))
    )

    (:action leave
        :parameters (?box - box ?location - location ?gripper - grip ?dron - dron ?person - person ?content - bcontent)
        :precondition (and (at-dron ?dron ?location)(carrying ?dron ?gripper ?box)(at-person ?person ?location)(box-has ?box ?content))
        :effect (and (at-box ?box ?location)(free ?gripper)(not(carrying ?dron ?gripper ?box))(person-has ?person ?content))
    )
)

; problem
(define (problem problem_size7)
(:domain emergencias)
(:objects
	dron1 - dron
	deposito refugio1 refugio2 refugio3 refugio4 refugio5 refugio6 refugio7 - location
	box1 box2 box3 box4 box5 box6 box7 - box
	comida medicina - bcontent
	person1 person2 person3 person4 person5 person6 person7 - person
	dron1-izq dron1-der - grip
)

(:init
	(at-dron dron1 deposito)
	(free dron1-izq)
	(free dron1-der)
	(at-box box1 deposito)
	(box-has box1 comida)
	(at-box box2 deposito)
	(box-has box2 comida)
	(at-box box3 deposito)
	(box-has box3 medicina)
	(at-box box4 deposito)
	(box-has box4 medicina)
	(at-box box5 deposito)
	(box-has box5 medicina)
	(at-box box6 deposito)
	(box-has box6 medicina)
	(at-box box7 deposito)
	(box-has box7 medicina)
	(at-person person1 refugio5)
	(at-person person2 refugio6)
	(at-person person3 refugio1)
	(at-person person4 refugio6)
	(at-person person5 refugio6)
	(at-person person6 refugio6)
	(at-person person7 refugio2)
)

(:goal (and
	(person-has person1 comida)
	(person-has person1 medicina)
	(person-has person2 comida)
	(person-has person2 medicina)
	(person-has person5 medicina)
	(person-has person6 medicina)
	(person-has person7 medicina)
))
)

; plan
1. (pick box4 deposito dron1-izq dron1)
   deleted: (at-box box4 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box4)
   goals met: 0 of 7
2. (pick box2 deposito dron1-der dron1)
   deleted: (at-box box2 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box2)
   goals met: 0 of 7
3. (move deposito refugio2 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio2)
   goals met: 0 of 7
4. (leave box4 refugio2 dron1-izq dron1 person7 medicina)
   deleted: (carrying dron1 dron1-izq box4)
   added: (at-box box4 refugio2) (free dron1-izq) (person-has person7 medicina)
   goals met: 1 of 7
5. (move refugio2 deposito dron1)
   deleted: (at-dron dron1 refugio2)
   added: (at-dron dron1 deposito)
   goals met: 1 of 7
6. (pick box7 deposito dron1-izq dron1)
   deleted: (at-box box7 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box7)
   goals met: 1 of 7
7. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 1 of 7
8. (leave box7 refugio6 dron1-izq dron1 person5 medicina)
   deleted: (carrying dron1 dron1-izq box7)
   added: (at-box box7 refugio6) (free dron1-izq) (person-has person5 medicina)
   goals met: 2 of 7
9. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 2 of 7
10. (pick box5 deposito dron1-izq dron1)
   deleted: (at-box box5 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box5)
   goals met: 2 of 7
11. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 2 of 7
12. (leave box2 refugio6 dron1-der dron1 person2 comida)
   deleted: (carrying dron1 dron1-der box2)
   added: (at-box box2 refugio6) (free dron1-der) (person-has person2 comida)
   goals met: 3 of 7
13. (move refugio6 deposito dron1)
   deleted: (at-dron dron1 refugio6)
   added: (at-dron dron1 deposito)
   goals met: 3 of 7
14. (pick box1 deposito dron1-der dron1)
   deleted: (at-box box1 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box1)
   goals met: 3 of 7
15. (move deposito refugio5 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio5)
   goals met: 3 of 7
16. (leave box1 refugio5 dron1-der dron1 person1 comida)
   deleted: (carrying dron1 dron1-der box1)
   added: (at-box box1 refugio5) (free dron1-der) (person-has person1 comida)
   goals met: 4 of 7
17. (leave box5 refugio5 dron1-izq dron1 person1 medicina)
   deleted: (carrying dron1 dron1-izq box5)
   added: (at-box box5 refugio5) (free dron1-izq) (person-has person1 medicina)
   goals met: 5 of 7
18. (move refugio5 deposito dron1)
   deleted: (at-dron dron1 refugio5)
   added: (at-dron dron1 deposito)
   goals met: 5 of 7
19. (pick box3 deposito dron1-izq dron1)
   deleted: (at-box box3 deposito) (free dron1-izq)
   added: (carrying dron1 dron1-izq box3)
   goals met: 5 of 7
20. (pick box6 deposito dron1-der dron1)
   deleted: (at-box box6 deposito) (free dron1-der)
   added: (carrying dron1 dron1-der box6)
   goals met: 5 of 7
21. (move deposito refugio6 dron1)
   deleted: (at-dron dron1 deposito)
   added: (at-dron dron1 refugio6)
   goals met: 5 of 7
22. (leave box3 refugio6 dron1-izq dron1 person2 medicina)
   deleted: (carrying dron1 dron1-izq box3)
   added: (at-box box3 refugio6) (free dron1-izq) (person-has person2 medicina)
   goals met: 6 of 7
23. (leave box6 refugio6 dron1-der dron1 person6 medicina)
   deleted: (carrying dron1 dron1-der box6)
   added: (at-box box6 refugio6) (free dron1-der) (person-has person6 medicina)
   goals met: 7 of 7
